src/object-diagram/logic/test-suites/linked-list/tests/2/writer/expected.puml
@startuml
map "<<[StackFrame]>>" as _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352 {
  args =>
  list =>
}
object "<<String[]>>" as _482d9dec6ff954d68d94793f765be61dbc59cb47 {
  []
}
map "<<LinkedList>>" as _7f72fde5bcfbd3fa5f2426e64a749e253c7dc602 {
  head =>
}
map "<<LinkedList$Node>>" as _228d691985f93beaed469d085317435fb3665ef9 {
  next =>
  value =>
}
map "<<LinkedList$Node>>" as _d2865ba5ee220622dea76e88fc2636f5678302a5 {
  next => null
  value =>
}
object "<<String>>" as _aa72d35e21c1d6132dbb8e75f8fbc7117c4f423d {
  "2"
}
object "<<String>>" as _25f504355ec07b115120e557c385e256ddbe8e4e {
  "1"
}
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::args => _482d9dec6ff954d68d94793f765be61dbc59cb47
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::list => _7f72fde5bcfbd3fa5f2426e64a749e253c7dc602
_7f72fde5bcfbd3fa5f2426e64a749e253c7dc602::head => _228d691985f93beaed469d085317435fb3665ef9
_228d691985f93beaed469d085317435fb3665ef9::next => _d2865ba5ee220622dea76e88fc2636f5678302a5
_d2865ba5ee220622dea76e88fc2636f5678302a5::value => _aa72d35e21c1d6132dbb8e75f8fbc7117c4f423d
_228d691985f93beaed469d085317435fb3665ef9::value => _25f504355ec07b115120e557c385e256ddbe8e4e
@enduml
